<a href="https://colab.research.google.com/github/pharris0330/Nonprofit_success/blob/main/msa_zip.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# Import the Pandas package
import pandas as pd

# Import the NumPy package
import numpy as np

# Import fundamental plotting library in Python
import matplotlib.pyplot as plt

In [ ]:
msa_zip = pd.read_csv('https://raw.githubusercontent.com/pharris0330/team_31/main/msa_zip.csv')

In [ ]:
msa_zip.head()

   Unnamed: 0       ZIP  STATE  MSA No.                            MSA NAME
0           1  ZIP CODE  STATE  MSA No.                            MSA Name
1           2     00210     NH    14460  Boston-Cambridge-Quincy, MA-NH MSA
2           3     00211     NH    14460  Boston-Cambridge-Quincy, MA-NH MSA
3           4     00212     NH    14460  Boston-Cambridge-Quincy, MA-NH MSA
4           5     00213     NH    14460  Boston-Cambridge-Quincy, MA-NH MSA

In [ ]:
msa_zip = msa_zip.drop([0])
msa_zip.head()

   Unnamed: 0    ZIP STATE MSA No.                            MSA NAME
1           2  00210    NH   14460  Boston-Cambridge-Quincy, MA-NH MSA
2           3  00211    NH   14460  Boston-Cambridge-Quincy, MA-NH MSA
3           4  00212    NH   14460  Boston-Cambridge-Quincy, MA-NH MSA
4           5  00213    NH   14460  Boston-Cambridge-Quincy, MA-NH MSA
5           6  00214    NH   14460  Boston-Cambridge-Quincy, MA-NH MSA

In [ ]:
# Define the consumption and generation categories we are interested in
consume_category = "PEC Electric Power Sector"
generate_category = "ENG Nuclear Electric Power"

# Select the Electric Power Sector for energy consumption
consume_df = clean_energy_df[clean_energy_df["Description"] == consume_category][
    ["YYYYMM", "Value"]
].reset_index(drop=True)

# Select nuclear electric power for energy consumption (all sectors)
generate_df = clean_electricity_df[
    clean_electricity_df["Description"] == generate_category
][["YYYYMM", "Value"]].reset_index(drop=True)

# Merge into one data frame for ease of plotting
merged_df = pd.merge(
    consume_df,
    generate_df,
    how="left",
    on=["YYYYMM"],
    suffixes=("_CONSUME", "_GENERATE"),
)

merged_df.head()